# RebarHandleNameData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandleNameData Class
Members See Also
---
This class is used to contain the information about the rebar handle name defined by an external application.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class RebarHandleNameData : IDisposable
```

Visual Basic
---
```text
Public Class RebarHandleNameData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarHandleNameData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarHandleNameData
# See Also
RebarHandleNameData Members
Autodesk.Revit.DB.Structure Namespace